In [2]:
import pandas as pd
import numpy as np

In [3]:
room_length=[10,20,12,34,43,20]
room_breadth=[20,20,10,11,25,16]
room_type=["big","big","normal","big","big","normal"]
data=pd.DataFrame({"length":room_length,
                  "breadth":room_breadth,
                   "type":room_type
                  })
data

   length  breadth    type
0      10       20     big
1      20       20     big
2      12       10  normal
3      34       11     big
4      43       25     big
5      20       16  normal

In [4]:
data["Area"]=data["length"]*data["breadth"]

In [5]:
data

   length  breadth    type  Area
0      10       20     big   200
1      20       20     big   400
2      12       10  normal   120
3      34       11     big   374
4      43       25     big  1075
5      20       16  normal   320

In [8]:
#Encoding categorical(Nominal)variables->One-Hot Encoding
age=[18,20,21,34,56,57,45]
city=["City A","City B","City A","City A","City C","City B","City A"]
data1=pd.DataFrame({"Age":age,"City":city})
print(data1)
dummy_features= pd.get_dummies(data1["City"])
print(dummy_features)
data_age=pd.DataFrame(data=data1,columns=["Age"])
data_mod=pd.concat([data_age,dummy_features],axis=1)
print("Final Dataset \n",data_mod)

   Age    City
0   18  City A
1   20  City B
2   21  City A
3   34  City A
4   56  City C
5   57  City B
6   45  City A
   City A  City B  City C
0       1       0       0
1       0       1       0
2       1       0       0
3       1       0       0
4       0       0       1
5       0       1       0
6       1       0       0
Final Dataset
    Age  City A  City B  City C
0   18       1       0       0
1   20       0       1       0
2   21       1       0       0
3   34       1       0       0
4   56       0       0       1
5   57       0       1       0
6   45       1       0       0

In [9]:
#encoding categorical (ordinal) variables
marks_science=[78,50,87,91,45,62]
marks_maths=[75,62,98,95,42,57]
grade=['B','C','A','A','D','B']
data=pd.DataFrame({'Science Marks':marks_science,
                  'Maths Marks': marks_maths,
                  'Total Grade':grade})
print(data)

   Science Marks  Maths Marks Total Grade
0             78           75           B
1             50           62           C
2             87           98           A
3             91           95           A
4             45           42           D
5             62           57           B

In [11]:
#option1
from  sklearn import preprocessing
le=preprocessing.LabelEncoder()
le.fit(data['Total Grade'])
data['Total Grade']=le.transform(data['Total Grade'])
print(data)

   Science Marks  Maths Marks  Total Grade
0             78           75            1
1             50           62            2
2             87           98            0
3             91           95            0
4             45           42            3
5             62           57            1

In [13]:
#option2
target=data['Total Grade'].replace(['A','B','C','D'],[0,1,2,3])
predictors=data.iloc[:,0:2]
data_mod=pd.concat([predictors,target],axis=1)
data_mod

   Science Marks  Maths Marks  Total Grade
0             78           75            1
1             50           62            2
2             87           98            0
3             91           95            0
4             45           42            3
5             62           57            1

In [14]:
apartment_area=[4720,2430,4368,3989,6142,7912]
apartment_price=[2360000,12510000,2104000,1984500,3071000,39560000]
data=pd.DataFrame({'Area':apartment_area,
                  'Price':apartment_price})
data

   Area     Price
0  4720   2360000
1  2430  12510000
2  4368   2104000
3  3989   1984500
4  6142   3071000
5  7912  39560000

In [17]:
data["Price Category"]=np.where(data['Price']>3000000,'High',
                              np.where(data['Price']<2000000,'Low',
                                      'Medium'))
data

   Area     Price Price Category
0  4720   2360000         Medium
1  2430  12510000           High
2  4368   2104000         Medium
3  3989   1984500            Low
4  6142   3071000           High
5  7912  39560000           High

In [ ]:
'''using a dataset with multiple numeric feature apply dimenstinality reduction to obtain 2 princple component
and visaulize the transformed data use pd.read_csv'''